In [1]:
import sqlite3   #import sql library

In [2]:
con =  sqlite3.connect('employees_database.db')  #Create connection & create new database

In [3]:
cur=  con.cursor() #create a cursor object

In [4]:
# Creating a new table employees in employees_Database

In [5]:
cur.execute("Create table employees(id int primary key, name text, age int,department text, salary int, join_year  int)")

In [6]:
#Insert values in table employees

In [7]:
cur.execute('insert into employees values(101,"Tasha",22,"Operations",38000,2006), (102,"Rayane",24,"Operations",34000,2008),(103,"Deidria",32,"TL",65000,2001), (104,"Mitzi",30,"HR",78000,2009),(105,"Dan",52,"Manager",108000,2004) ')
con.commit()
print(cur.rowcount,"Record(s) inserted")

5 Record(s) inserted

In [8]:
#Output Results as per queries for printing table of all employees from employees table

In [9]:
result= cur.execute('Select * from employees')
result.fetchall()

[(101, 'Tasha', 22, 'Operations', 38000, 2006),
 (102, 'Rayane', 24, 'Operations', 34000, 2008),
 (103, 'Deidria', 32, 'TL', 65000, 2001),
 (104, 'Mitzi', 30, 'HR', 78000, 2009),
 (105, 'Dan', 52, 'Manager', 108000, 2004)]

In [10]:
#Using WHERE Clause

result1= cur.execute("Select * from employees WHERE department='HR'")
result1.fetchall()

[(104, 'Mitzi', 30, 'HR', 78000, 2009)]

In [14]:
result2= cur.execute('select name,salary from employees WHERE salary > 50000')
result2.fetchall()

[('Deidria', 65000), ('Mitzi', 78000), ('Dan', 108000)]

In [15]:
result3= cur.execute('select * from employees WHERE age < 25 AND department= "Operations"')
result3.fetchall()

[(101, 'Tasha', 22, 'Operations', 38000, 2006),
 (102, 'Rayane', 24, 'Operations', 34000, 2008)]

In [16]:
#Using Orderby Clause

In [17]:
result= cur.execute('select * from employees ORDER BY name asc ')
result.fetchall()

[(105, 'Dan', 52, 'Manager', 108000, 2004),
 (103, 'Deidria', 32, 'TL', 65000, 2001),
 (104, 'Mitzi', 30, 'HR', 78000, 2009),
 (102, 'Rayane', 24, 'Operations', 34000, 2008),
 (101, 'Tasha', 22, 'Operations', 38000, 2006)]

In [19]:
result1= cur.execute('select name from employees ORDER BY salary DESC ')
result1.fetchall()

[('Dan',), ('Mitzi',), ('Deidria',), ('Tasha',), ('Rayane',)]

In [20]:
#Using Aggregate functions

In [21]:
result= cur.execute("Select max(salary) from employees ")
result.fetchone()

(108000,)